source/_posts/2015-01-01-building-emacs-24.4-on-ubuntu-14.04.html
---
title: "Building Emacs 24.4 on Ubuntu 14.04"
date: 2015-01-01
layout: post
categories: 
published: true
comments: 
---
<p>
I recently signed up for a Virtual Private Server (VPS) with <a href="https://vpsdime.com">vpsdime</a>.
The idea is to set-up a complete development environment for all of my
work and personal projects that I can access from a low-end device
like a <a href="https://www.google.com/chrome/devices/">Chromebook</a> or an <a href="https://www.apple.com/ipad/">iPad</a> (with a suitable SSH app installed).
</p>

<p>
<!-- more -->
</p>

<p>
I opted for the <i>High RAM VPS</i>, which has the following
specifications:
</p>

<ul class="org-ul">
<li>6 GB RAM
</li>
<li>4 CPUs
</li>
<li>30GB Storage
</li>
<li>2TB/month traffic
</li>
<li>10 Gb connection
</li>
</ul>

<p>
It is very reasonably priced at only $7.00/month.  I had it spun up
with Ubuntu 14.04 LTS.
</p>

<p>
My first requirements were installing <a href="http://www.gnu.org/software/emacs/">Emacs 24.4</a> 24.3 is the only
version available in the repositories and I found no <a href="https://launchpad.net/ubuntu/+ppas">Personal Package
Archive (PPA)</a> that already supplied it. The remainder of this post
documents the steps required to do this.
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Dependencies</h2>
<div class="outline-text-2" id="text-1">
<p>
There are a few things you need to have installed before you can build
Emacs.  You need to update your list of <a href="https://help.ubuntu.com/community/Repositories/CommandLine">repository sources</a> first.
</p>

<p>
Edit the file <code>/etc/apt/sources.list</code> as root.  On a new Ubuntu 14.04 instance
it looks like this:
</p>

<pre class="example">
deb http://archive.ubuntu.com/ubuntu trusty main restricted universe
deb http://archive.ubuntu.com/ubuntu trusty-updates main restricted universe
deb http://security.ubuntu.com/ubuntu trusty-security main restricted universe multiverse
deb http://archive.canonical.com/ubuntu trusty partner
</pre>

<p>
You need to enable the source code repositories.  This is very simple
to do.  Just duplicate the first four lines in the file and change
<code>deb</code> at the beginning of the line to <code>deb-src</code>.  When you have done
this the file will look like this:
</p>

<pre class="example">
deb http://archive.ubuntu.com/ubuntu trusty main restricted universe
deb http://archive.ubuntu.com/ubuntu trusty-updates main restricted universe
deb http://security.ubuntu.com/ubuntu trusty-security main restricted universe multiverse
deb http://archive.canonical.com/ubuntu trusty partner
deb-src http://archive.ubuntu.com/ubuntu trusty main restricted universe
deb-src http://archive.ubuntu.com/ubuntu trusty-updates main restricted universe
deb-src http://security.ubuntu.com/ubuntu trusty-security main restricted universe multiverse
deb-src http://archive.canonical.com/ubuntu trusty partner
</pre>

<p>
Save your changes and then run the following command:
</p>

<div class="org-src-container">

<pre class="src src-sh">sudo apt-get update
</pre>
</div>

<p>
Now you can install the dependencies that you will need:
</p>

<div class="org-src-container">

<pre class="src src-sh">sudo apt-get install build-essential
sudo apt-get build-dep emacs24
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Building Emacs 24.4</h2>
<div class="outline-text-2" id="text-2">
<p>
I like to organize my projects in a directory hierarchy like this:
</p>

<ul class="org-ul">
<li><code>$HOME/Projects/</code>
<ul class="org-ul">
<li><code>0-9/</code>
</li>
<li><code>a/</code>
</li>
<li><code>b/</code>
</li>
<li>&#x2026;
</li>
<li><code>z/</code>
</li>
</ul>
</li>
</ul>

<p>
So, my Emacs build would be located in the <code>$HOME/Projects/e</code>
directory.  Please feel free to ignore the above.  It is just a
personal preference.  With that out of the way, here we go&#x2026;
</p>

<div class="org-src-container">

<pre class="src src-sh">mkdir -p $<span style="color: #e7c547;">HOME</span>/Projects/e
<span style="color: #c397d8;">cd</span> $<span style="color: #e7c547;">HOME</span>/Projects/e
wget ftp.gnu.org/gnu/emacs/emacs-24.4.tar.xz
tar -xf emacs-24.4.tar.xz
rm emacs-24.4.tar.xz
<span style="color: #c397d8;">cd</span> emacs-24.4
./configure
make
sudo make install
</pre>
</div>

<p>
That's all there is to it!
</p>
</div>
</div>
